#include <Arduino.h>


#define TRANSISTOR_OUT 15  // Пін до якого підключено транзистор, що керує схемою
#define BUTTON_IN 16       // Пін до якого підключено кнопку, що керуватиме швидкістю

void setup() {
    // Налаштовуємо пін як вихід (OUTPUT), щоб контролер міг подавати на нього напругу
    pinMode(TRANSISTOR_OUT, OUTPUT);
    // Налаштовуємо пін як вхід (INPUT), щоб контролер міг читити з нього напругу
    pinMode(BUTTON_IN, INPUT);
}

void loop() {

    // Зчитуємо сигнал з кнопки. Якщо кнопка натиснута - пришвидшуємо миготіння, якщо ні - сповільнюємо 
    int delay_ms = digitalRead(BUTTON_IN) == HIGH ? 200 : 600;

    // Подаємо струм на транзистор щоб увімкнути червоний світлодіод
    // Синій залишається вимкненим через логічне НЕ
    digitalWrite(TRANSISTOR_OUT, HIGH);
    delay(delay_ms);
  
    // Прибираємо струм з транзисторащоб увімкнути синій світлодіод
    // Червоний світлодіод залишається вимкненим через логічне НЕ
    digitalWrite(TRANSISTOR_OUT, LOW);
    delay(delay_ms);
}